tutorials/pimpleHFDIBFoam/pelvis/0/0.org/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  x0
  {
      type            zeroGradient;
  }
  x1
  {
    type            zeroGradient;
  }

  z0
  {
      type            symmetry;

  }

  z1
  {
      type            symmetry;

  }


  frontAndBack
  {
      type            empty;
  }
}



// ************************************************************************* //
