tutorials/pimpleHFDIBFoam/pelvis/system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    {
        name    c0;
        type    cellZoneSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file            "$FOAM_CASE/constant/triSurface/pelvis_small.stl";
            useSurfaceOrientation false;  // use closed surface inside/outside
            outsidePoints   ((0.1 0 0.005));    // definition of outside
            includeCut      true;              // cells cut by surface
            includeInside   false;              // cells not on outside of surf
            includeOutside  false;              // cells on outside of surf
            nearDistance    0.004;                 // cells with centre near surf
            // (set to -1 if not used)
            curvature       -100;                // cells within nearDistance
            // and near surf curvature (set to -100 if not used)
        }
    }
);

// ************************************************************************* //
